В современном мире периферийное оборудование играет ключевую роль в оснащении как домашних, так и корпоративных рабочих мест. Бренд Epson на протяжении многих лет является одним из лидеров в области печатных технологий, предлагая широкий спектр устройств — от струйных МФУ до широкоформатных принтеров. Эффективная презентация этой техники в интернете требует продуманной структуры и удобного интерфейса. Целью данной курсовой работы является проектирование и разработка сайта для демонстрации и каталогизации принтеров Epson. В работе будут рассмотрены современные подходы к верстке, адаптивному дизайну и юзабилити, что позволит создать информативный и визуально привлекательный ресурс.
data = [
    {"id": 1},
    {"id": 2},
    {"id": 3}
]
for i in range(len(data)):
     if data[i]["id"] == 2:
        print (data[i]["id"])
